Revit 2027 API
Document.NewSpaces2(Phase, Int32) Method
 Creates a set of new unplaced spaces on a given phase.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> NewSpaces2(
	Phase phase,
	int count
)
Public Function NewSpaces2 (
	phase As Phase,
	count As Integer
) As ICollection(Of ElementId)
public:
ICollection<ElementId^>^ NewSpaces2(
	Phase^ phase,
	int count
)
member NewSpaces2 :
        phase : Phase *
        count : int -> ICollection<ElementId>
Parameters
phase Phase
 The phase in which the spaces are to exist.
count Int32
Return Value
ICollection<ElementId>
 If successful, a set of ElementIds of new unplaced spaces are be returned, otherwise null.
Exceptions
Exception | Condition
ArgumentException | Thrown if the phase does not exist in the given document.
See Also
Reference
Document Class
NewSpaces2 Overload
Autodesk.Revit.Creation Namespace